In [2]:
import pandas as pd
import numpy as np

In [3]:
dictionary1 = {"Name" : ["A", "B", "C", "D"],
               "Sport" : ["Running", "Football", "Golf", "Swimming"],
               "Calory" : [100, 200, 300, 400]
           }

In [5]:
dataFrame1 = pd.DataFrame(dictionary1, index = [1,2,3,4])

In [6]:
dataFrame1

  Name     Sport  Calory
1    A   Running     100
2    B  Football     200
3    C      Golf     300
4    D  Swimming     400

In [8]:
dictionary2 = {"Name" : ["E", "F", "G", "H"],
               "Sport" : ["Running", "Football", "Golf", "Swimming"],
               "Calory" : [150, 300, 240, 125]
           }

In [9]:
dataFrame2 = pd.DataFrame(dictionary2, index = [5,6,7,8])

In [10]:
dataFrame2

  Name     Sport  Calory
5    E   Running     150
6    F  Football     300
7    G      Golf     240
8    H  Swimming     125

In [18]:
dictionary3 = {"Name" : ["I", "J", "K", "L"],
               "Sport" : ["Running", "Football", "Golf", "Swimming"],
               "Calory" : [250, 225, 360, 150]
           }
dataFrame3 = pd.DataFrame(dictionary3, index = [9,10,11,12])

In [19]:
dataFrame3

   Name     Sport  Calory
9     I   Running     250
10    J  Football     225
11    K      Golf     360
12    L  Swimming     150

### Concatenation

In [15]:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)

   Name     Sport  Calory
1     A   Running     100
2     B  Football     200
3     C      Golf     300
4     D  Swimming     400
5     E   Running     150
6     F  Football     300
7     G      Golf     240
8     H  Swimming     125
9     I   Running     250
10    J  Football     225
11    K      Golf     360
12    L  Swimming     150